{
  "projects": [
    {
      "preview": "assets/media/projects/sc.PNG",
      "created_at": "2019-07-20T14:18:15.923+02:00",
      "name": "SC.EXE",
      "description": "Implementation of windows command line program sc that is used for communicating with the Service Control Manager and services. The implementaion is done using WIN32 APIs in C++. \n\nhttps://github.com/nixonion/sc"
    },
    {
      "preview": "assets/media/projects/chain.PNG",
      "created_at": "2019-07-20T14:18:15.923+02:00",
      "name": "Network Enabled Secure Game",
      "description": "Developed a client-server model game secured from SQL injection, DoS Attacks, buffer overflow, snooping, data leaks, resource exhaustion, and input validation attacks, and removed all vulnerabilities through static and dynamic analysis of source code\n\n https://github.com/agent00097/chain_reaction_python"
    },
    {
      "preview": "assets/media/projects/cobit.PNG",
      "created_at": "2019-07-20T14:24:00.709+02:00",
      "name": "Security Audit and Compliance policy COBIT",
      "description": "Created an IT security policy for a large organization that is in accordance with COBIT/PCI-DSS guidelines and drafted a Security Audit Program and Compliance testing policy \n\nhttps://github.com/nixonion/Cobit-Security-Policy"
    },
    {
      "preview": "assets/media/projects/blockicmp.PNG",
      "created_at": "2019-07-20T14:31:12.567+02:00",
      "name": "Block ICMP",
      "description": "Implementation of C based firewall in Linux to block ICMP packets \n\nhttps://github.com/nixonion/Block-ICMP"
    },
    {
      "preview": "assets/media/projects/ghidra.png",
      "created_at": "2020-02-27T23:48:54.263+02:00",
      "name": "Malware Analysis",
      "description": "Performed static and dynamic analysis of given set of binaries using Procmon, TCPview, PEID, and few other tools. Post analysis, reverse engineered the binaries using IDA pro, Ghidra and Ollydbg to find out the win32 API calls and deduced the higher-level language code."
    },
    {
      "preview": "assets/media/projects/macro.PNG",
      "created_at": "2020-03-03T09:50:59.791+02:00",
      "name": "Word MACRO",
      "description": "This is VBSCRIPT code for word document MACRO that gathers information like hostname, current user and current directory and sends it to a server using POST request. \n\nhttps://github.com/nixonion/Macro-to-gather-info" 
    },
    {
      "preview": "assets/media/projects/crop.PNG",
      "created_at": "2020-03-03T09:50:59.791+02:00",
      "name": "Crop Advisor",
      "description": "A GIS-based application to aid the dynamic agricultural sector of India. The project consisted of a web application, Middleware and an android application. We used Android Studio, Firebase, AWS EC2, AWS RDS, Python Scikit, Google Collab, MapBox(GIS), QGIS and Leaflet to complete this project.\n\n https://github.com/nixonion/Crop-Advisor"
    },
    {
      "preview": "assets/media/projects/mbox.PNG",
      "created_at": "2020-03-03T09:50:59.791+02:00",
      "name": "Remote Execution of Shell code and API hookers",
      "description": "C++ code for remote execution of a shell code in a different process using CreateRemodeThread Win32 API along with the implementaion of API hookers to detect CreateRemodeThread API call. \n\nhttps://github.com/nixonion/Remote-Execution-of-Shellcode\nhttps://github.com/nixonion/VIrtualExDetection"
    }
  ]
}

